app/Models/AdminModel.php

    public function verifyEmail($email)
    {
        $builder = $this->db->table('admins');
        $builder->select("email, password, username, photo, position, Tel");
        $builder->where('email', $email);
        $result = $builder->get()->getRowArray();
---
SELECT `email`, `password`, `username`, `photo`, `position`, `Tel`
FROM `admins`
WHERE `email` = 'uclf@gmail.com'

    public function getEmail($email)
    {
        $builder = $this->db->table('admins');
        $builder->select("email, password, username");
        $builder->where('email', $email);
        $res = $builder->get()->getRow();
---
SELECT `email`, `password`, `username`
FROM `admins`
WHERE `email` = 'uclf@gmail.com'