app/Models/CategoryModel.php

    public function getAll()
    {
        $builder = $this->db->table('category');
        return $result= $builder->get()->getResultArray();
---
SELECT *
FROM `category`