app/Models/ForumModel.php

SELECT *
FROM `forums`
WHERE `user_id` = '6ee98e387147c54ebbd4b357c13c0d8c'
---
      public function fetchQNs($user_id)
      {
        $builder = $this->db->table('forums');
        $builder->select('*');
        $builder->where('user_id',$user_id,);
        $result = $builder->get()->getResultArray();

SELECT *
FROM `forums`
WHERE `category` = 'Announcement'
---
      public function topicQNs($user_id)
      {
        $builder = $this->db->table('forums');
        $builder->select('*');
        $builder->where('category',$user_id,);
        $result = $builder->get()->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `forums`
WHERE `category` = 'Announcement'
---
      public function topicCount($user_id)
      {
        $builder = $this->db->table('forums');
        $builder->select('*');
        $builder->where('category', $user_id);
        //$builder->where('status', '0');
        $query = $builder->countAllResults();

SELECT `category`, COUNT(*) as question_count
FROM `forums`
GROUP BY `category`
---
      public function getCategoryQuestionCount()
      {
          return $this->select('category, COUNT(*) as question_count')
                      ->groupBy('category')
                      ->get()
                      ->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `forums`
WHERE `user_id` = '6ee98e387147c54ebbd4b357c13c0d8c'
---
      public function countQNs($user_id)
      {
        $builder = $this->db->table('forums');
        $builder->select('*');
        $builder->where('user_id', $user_id);
        //$builder->where('status', '0');
        $query = $builder->countAllResults();