app/Models/LoginModel.php

SELECT `Account_status`
FROM `members`
WHERE `user_id` IS NULL
---
    public function getAccountStatus($id)
    {
        $builder = $this->db->table('members');
        $query = $builder->select('Account_status')->where('user_id', $id)->get();

SELECT *
FROM `members`
WHERE `user_id` = '6ee98e387147c54ebbd4b357c13c0d8c'
---
    public function verifyUserid($id)
    {
        $builder = $this->db->table('members');
        $builder->select('*');
        $builder->where('user_id',$id);
        $result = $builder->get()->getRow();

SELECT `user_id`, `Email`, `FirstName`, `LastName`, `Membership_type`, `Tel`, `Password`, `Account_status`
FROM `members`
WHERE `Email` = 'matovu@lwegatech.com'
---
    public function verifyEmail($email)
    {
        $builder = $this->db->table('members');
        $builder->select("user_id, Email, FirstName, LastName, Membership_type, Tel, Password, Account_status");
        $builder->where('Email', $email);
        $result = $builder->get()->getRowArray();

SELECT `user_id`, `Email`, `FirstName`, `LastName`, `Membership_type`, `Tel`, `Account_status`
FROM `members`
WHERE `user_id` = 'aa4e8adad0362e363af272d876439e4f'
---
    public function verifyUser($id)
    {
        $builder = $this->db->table('members');
        $builder->select("user_id, Email, FirstName, LastName, Membership_type, Tel, Account_status");
        $builder->where('user_id', $id);
        $result = $builder->get()->getRowArray();