app/Models/MemberRegModel.php

    public function verifyUserid($id)
    {
        $builder = $this->db->table('members');
        $builder->select('*');
        $builder->where('user_id',$id);
        $result = $builder->get()->getRow();
---
SELECT *
FROM `members`
WHERE `user_id` = '045f3a66e99eb7d6734bfab496cc9b27'

    public function updateStatus($user_id)
      {
        $builder = $this->db->table('members');
        $builder->where('user_id',$user_id,);
        $builder->update(['Account_status' => 'Pending']);
        $result = $builder->get()->getRow();
---
UPDATE `members` SET `Account_status` = 'Pending'
WHERE `user_id` = '045f3a66e99eb7d6734bfab496cc9b27'
SELECT *
FROM `members`

    public function getStatus($user_id)
      {
        $builder = $this->db->table('members');
        $builder->select('*');
        $builder->where('user_id',$user_id,);
        $result = $builder->get()->getRow();
---
SELECT *
FROM `members`
WHERE `id` = '13'