app/Models/OnboardModel.php

    public function verifyUserid($id)
    {
        $builder = $this->db->table('membship');
        $builder->select('*');
        $builder->where('user_id',$id);
        $result = $builder->get()->getRow();
---
SELECT *
FROM `membship`
WHERE `user_id` = '045f3a66e99eb7d6734bfab496cc9b27'