app/Models/OnboardModel.php

    public function getUsers($id)
    {
        $onboardModel = new OnboardModel();
        $builder = $onboardModel->builder();
        $builder = $this->db->table('membship');
        $builder->select('Region, State, City, Address, Company, Position, Practice_area, user_id, Photo');
        $builder->where('user_id', $id);
        $res = $builder->get()->getRowArray();
---
SELECT `Region`, `State`, `City`, `Address`, `Company`, `Position`, `Practice_area`, `user_id`, `Photo`
FROM `membship`
WHERE `user_id` = '045f3a66e99eb7d6734bfab496cc9b27'