app/Models/ResponseModel.php

SELECT `qn_id`, COUNT(*) as comment_count
FROM `responses`
GROUP BY `qn_id`
---
      public function fetchResponse($qn_id)
      {
        $builder = $this->db->table('responses');
        $builder->select('*');
        $builder->where('qn_id',$qn_id,);
        $result = $builder->get()->getResultArray();