app/Models/UnotifyModel.php

    public function readAll($user_id)
      {
        $builder = $this->db->table('usernotified');
        $builder->where('user_id', $user_id);
        $builder->where('status', '0');
        $builder->update(['status' => '1']);
        $query = $builder->get()->getResultArray();
---
UPDATE `usernotified` SET `status` = '1'
WHERE `user_id` = '8178c7c527cf178f1caa6a3492954459'
AND `status` = '0'
SELECT *
FROM `usernotified`

    public function updateStati($user_id, $statusID)
      {
        $builder = $this->db->table('usernotified');
        $builder->where('user_id',$user_id,);
        $builder->where('id', $statusID);
        $builder->update(['status' => '1']);
---
UPDATE `usernotified` SET `status` = '1'
WHERE `user_id` = '8178c7c527cf178f1caa6a3492954459'
AND `id` IS NULL

      public function fetchNotif($user_id)
      {
        $builder = $this->db->table('usernotified');
        $builder->select('*');
        $builder->where('user_id',$user_id,);
        $result = $builder->get()->getResultArray();
---
SELECT *
FROM `usernotified`
WHERE `user_id` = '6ee98e387147c54ebbd4b357c13c0d8c'

      public function count_unread_notifications($user_id)
      {
        $builder = $this->db->table('usernotified');
        $builder->select('*');
        $builder->where('user_id', $user_id);
        $builder->where('status', '0');
        $query = $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `usernotified`
WHERE `user_id` = '6ee98e387147c54ebbd4b357c13c0d8c'
AND `status` = '0'